InformationRegisters/СТ_МестаХраненияНоменклатурыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СТ_МестаХраненияНоменклатурыНаСкладах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СТ_Аналоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СТ_Аналоги</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналогДляПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СТ_КлючиПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СТ_КлючиПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПоиска</Name>
					<Comment>Поиск будет по этому полю в режиме "ПОДОБНО". Строка состоит из приведенных к "нормальному" виду ключей.  </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписиПоОбъекту</Name>
					<Comment>По одному объекту может быть несколько записей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДействиеСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействияСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментПартнеров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКартЛояльности</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СТ_ДополнительныеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СТ_ДополнительныеСкидки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДействияСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыДействияСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СегментНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборКомпоновкиДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДляКаждойСтроки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартаЛояльности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкруглениеСуммы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоПодписиПоДоверенности</Name>
					<Comment>Если Ложь - то это основное ответственное лицо, если Истина - то лицо, которое только имеет право подписи документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СТ_ОбщегоНазначения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе

// Заполняет дополнительные реквизиты по номенклатуре в коллекции
//
// Параметры:
// 		КоллекцияДанных - ДанныеФормыКоллекция, ТаблицаЗначний - Таблица, в которой необходимо заполнить реквизиты
// 		Реквизиты - Строка - Строка с перечислением через запятую имен реквизитов для заполнения
// 		СтрокиЗаполнения - Массив ДанныеФормыЭлементКоллекции - строки, для которых требуется заполнение
//
Процедура ЗаполнитьДополнительныеРеквизитыПоНоменклатуреВКоллекции(КоллекцияДанных, СтруктураДействий, СтрокиЗаполнения = Неопределено) Экспорт
	
	//Запрос = Новый Запрос(ОбработкаТабличнойЧастиСервер.ПолучитьТекстЗапросаПоСлужебнымРеквизитамТЧ(СтруктураДействий, СтруктураДопДанных));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	               |	Таблица.Номенклатура
	               |ПОМЕСТИТЬ втТаблицаНоменклатуры
	               |ИЗ
	               |	&КоллекцияДанных КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Синоним1
	               |ИЗ
	               |	втТаблицаНоменклатуры КАК втТаблицаНоменклатуры
	               |		Внутреннее СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО втТаблицаНоменклатуры.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |			И (НоменклатураДополнительныеРеквизиты.Свойство = &Свойство)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
				   
	// Пока в СтруктураДействий должен быть только 1 элемент. Если понадобится
	Для Каждого Действие Из СтруктураДействий Цикл
		Если СтруктураДействий.Свойство("ЗаполнитьМестоХранения") Тогда
			Для каждого СтруктураДействие Из СтруктураДействий.ЗаполнитьМестоХранения Цикл
			
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Синоним1", СтруктураДействие.Ключ);
				Запрос.УстановитьПараметр("Свойство", СтруктураДействие.Значение);
			
			КонецЦикла; 
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЦикла;
	
	Если СтрокиЗаполнения = Неопределено Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить( ,"НомерСтроки,Номенклатура");
	ИначеЕсли СтрокиЗаполнения.Количество() > 0 Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить(СтрокиЗаполнения ,"НомерСтроки,Номенклатура");
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КоллекцияДанных", ПараметрКоллекция);
	
	Если СтрокиЗаполнения <> Неопределено Тогда
		
		ТЗРезультат = Запрос.Выполнить().Выгрузить();
		Для Каждого Стр Из ТЗРезультат Цикл
			ЗаполнитьЗначенияСвойств(КоллекцияДанных[Стр.Номерстроки - 1], Стр);
		КонецЦикла;
		
	Иначе
		
		Выборка = Запрос.Выполнить().Выбрать();
		Для Н=0 По КоллекцияДанных.Количество()-1 Цикл
			Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
			ЗаполнитьЗначенияСвойств(КоллекцияДанных[Н], Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыВКоллекции()

// Заполняет дополнительные реквизиты по номенклатуре в коллекции
//
// Параметры:
// 		КоллекцияДанных - ДанныеФормыКоллекция, ТаблицаЗначний - Таблица, в которой необходимо заполнить реквизиты
// 		Реквизиты - Строка - Строка с перечислением через запятую имен реквизитов для заполнения
// 		СтрокиЗаполнения - Массив ДанныеФормыЭлементКоллекции - строки, для которых требуется заполнение
//
Процедура ЗаполнитьМестаХраненияПоНоменклатуреВКоллекции(КоллекцияДанных, ПараметрыЗаполнения, СтрокиЗаполнения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	               |	Таблица.Номенклатура,
	               |	&Склад
	               |ПОМЕСТИТЬ втТаблицаНоменклатуры
	               |ИЗ
	               |	&КоллекцияДанных КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(МестаХранения.МестоХранения, """") КАК МестоХранения
	               |ИЗ
	               |	втТаблицаНоменклатуры КАК втТаблицаНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СТ_МестаХраненияНоменклатурыНаСкладах.СрезПоследних(
	               |				,
	               |				(Номенклатура, Склад) В
	               |					(ВЫБРАТЬ
	               |						вт.Номенклатура,
	               |						вт.Склад
	               |					ИЗ
	               |						втТаблицаНоменклатуры КАК вт)) КАК МестаХранения
	               |		ПО втТаблицаНоменклатуры.Номенклатура = МестаХранения.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
				   	
	Если СтрокиЗаполнения = Неопределено Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить( ,"НомерСтроки,Номенклатура");
	ИначеЕсли СтрокиЗаполнения.Количество() > 0 Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить(СтрокиЗаполнения ,"НомерСтроки,Номенклатура");
	Иначе
		Возврат;
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад", ПараметрыЗаполнения.Склад);
	Запрос.УстановитьПараметр("КоллекцияДанных", ПараметрКоллекция);
	
	Если СтрокиЗаполнения <> Неопределено Тогда
		
		ТЗРезультат = Запрос.Выполнить().Выгрузить();
		Для Каждого Стр Из ТЗРезультат Цикл
			ЗаполнитьЗначенияСвойств(КоллекцияДанных[Стр.Номерстроки - 1], Стр);
		КонецЦикла;
		
	Иначе
		
		Выборка = Запрос.Выполнить().Выбрать();
		Для Н=0 По КоллекцияДанных.Количество()-1 Цикл
			Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в коллекции
			ЗаполнитьЗначенияСвойств(КоллекцияДанных[Н], Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыВКоллекции()

// Получает значение дополнительного реквизита объекта
//
// Параметры:
//  ВладелецСвойств - Ссылка - например, СправочникСсылка.Номенклатура, ДокументСсылка.ЗаказПокупателя, ...
//  Свойство        - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - проверяемое свойство.
//
// Возвращаемое значение:
//  Значение свойства или Неопределено, если такого свойства нет
//
Функция ПолучитьЗначениеДополнительногоРеквизита(ВладелецСвойств, Свойство) Экспорт
	
	ЗначениеДополнительногоРеквизита = Неопределено;
	
	ТаблицаСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(ВладелецСвойств, Истина, Ложь, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Свойство));
	
	Для каждого СтрокаСвойства Из ТаблицаСвойств Цикл
		ЗначениеДополнительногоРеквизита = СтрокаСвойства.Значение;    		
		Прервать;
	КонецЦикла; 
	
	Возврат ЗначениеДополнительногоРеквизита;

КонецФункции // ПолучитьЗначениеДополнительногоРеквизита()

Функция ПолучитьКлючПоСтроке(Знач Строка) Экспорт
	
	Строка = Строка(Строка);
	RegExp = Новый COMОбъект("VBScript.RegExp");	
	RegExp.MultiLine = Ложь; 
	RegExp.Global = Истина;
	RegExp.Pattern = "[^А-яA-z0-9]";
	
	Результат = RegExp.Replace(Строка, "");
	
	Возврат Результат;  

КонецФункции // ПолучитьКлючПоНаименованию()

Процедура ОбновитьКлючПоискаДляОбъектов(МассивОбъектов, Отказ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Артикул,
		|	Номенклатура.Производитель,
		|	Номенклатура.ПометкаУдаления
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СТ_АналогиСрезПоследних.Номенклатура,
		|	СТ_АналогиСрезПоследних.АналогДляПоиска
		|ИЗ
		|	РегистрСведений.СТ_Аналоги.СрезПоследних(, Номенклатура В (&МассивОбъектов)) КАК СТ_АналогиСрезПоследних
		|ГДЕ
		|	СТ_АналогиСрезПоследних.Действует";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаОбъектов = ПакетЗапросов[0].Выбрать();
	ТаблицаАналогов = ПакетЗапросов[1].Выгрузить();
	
	Пока ВыборкаОбъектов.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.СТ_КлючиПоиска.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ВыборкаОбъектов.Ссылка);
		
		НомерЗаписиПоОбъекту = 0;
		
		Если НЕ ВыборкаОбъектов.ПометкаУдаления Тогда
			
			КлючПоиска = "";
			
			ДобавитьСтрокуВКлючПоиска(КлючПоиска, ВыборкаОбъектов.Артикул);
			ДобавитьСтрокуВКлючПоиска(КлючПоиска, ВыборкаОбъектов.Производитель);
			
			СтрокиАналогов = ТаблицаАналогов.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаОбъектов.Ссылка));
			Для каждого СтрокаАналога Из СтрокиАналогов Цикл
					
				ДобавитьСтрокуВКлючПоиска(КлючПоиска, СтрокаАналога.АналогДляПоиска);
				
				Если СтрДлина(КлючПоиска) > 1000 Тогда
					НоваяЗапись = НаборЗаписей.Добавить();		
					НоваяЗапись.Объект = ВыборкаОбъектов.Ссылка;
					НоваяЗапись.КлючПоиска = КлючПоиска;					
					НоваяЗапись.НомерЗаписиПоОбъекту = НомерЗаписиПоОбъекту;
					КлючПоиска = "";
					НомерЗаписиПоОбъекту = НомерЗаписиПоОбъекту + 1;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(КлючПоиска) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();		
				НоваяЗапись.Объект = ВыборкаОбъектов.Ссылка;
				НоваяЗапись.НомерЗаписиПоОбъекту = НомерЗаписиПоОбъекту;
				НоваяЗапись.КлючПоиска = КлючПоиска;	
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			
			НаборЗаписей.Записать();		
			
		Исключение
			
			Отказ = Истина;
			
			ШаблонОшибки = "Не удалось обновить ключ поиска объекта: %1
			| по причине: %2";
			
			ПредставлениеИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
				Строка(ВыборкаОбъектов.Ссылка), 
				ОписаниеОшибки());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПредставлениеИсключения, ВыборкаОбъектов.Ссылка);
			
			ЗаписьЖурналаРегистрации(
				ПредставлениеИсключения,
				УровеньЖурналаРегистрации.Ошибка,
				ВыборкаОбъектов.Ссылка.Метаданные(),
				ВыборкаОбъектов.Ссылка);
				
		КонецПопытки;		
		
	КонецЦикла;  

КонецПроцедуры

Процедура ЗаписатьСтатистикуПоиска(Форма, КлючПоиска) Экспорт

	ДатаЗапроса = ТекущаяДата();
	Пользователь = Пользователи.ТекущийПользователь();
	// Велосипед не мой. Пока не нужно
	////получим результаты поискового запроса
	//Список = Элементы.СписокНоменклатуры;	
	//Схема = Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	//Настройки = Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//
	//Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//ДатаЗапроса = ТекущаяДата();
	//Пользователь = Пользователи.ТекущийПользователь();
	//
	////создадим набор записей
	//Набор = РегистрыСведений.СТ_СтатистикаЗапросов.СоздатьНаборЗаписей();
	//Набор.Отбор.Период.Установить(ДатаЗапроса);
	//Набор.Отбор.Запрос.Установить(КлючПоиска);
	//Набор.Отбор.Пользователь.Установить(Пользователь);
	//
	//Если Результат.Количество() > 50 Тогда  //слишком много результатов
	//	СтатусЗапроса = Перечисления.СТ_СтатусыЗапросов.D;
	//	
	//	Запись = Набор.Добавить();
	//	Запись.Период = ДатаЗапроса;
	//	Запись.Пользователь = Пользователь;
	//	Запись.НомерСтрокиРезультата = 1;
	//	Запись.Статус = СтатусЗапроса;
	//	Запись.Запрос = КлючПоиска;
	//	Набор.Записать();
	//	
	//ИначеЕсли Результат.Количество() = 0 Тогда   //ничего не найдено
	//	СтатусЗапроса = Перечисления.СТ_СтатусыЗапросов.C;
	//	
	//	Запись = Набор.Добавить();
	//	Запись.Период = ДатаЗапроса;
	//	Запись.Пользователь = Пользователь;
	//	Запись.НомерСтрокиРезультата = 1;
	//	Запись.Статус = СтатусЗапроса;
	//	Запись.Запрос = КлючПоиска;
	//	Набор.Записать();
	//	
	//Иначе   //обработаем кажду строку результата
	//	ТекНомерСтроки = 1;
	//	Для каждого СтрокаРезультата Из Результат Цикл
	//		Запись = Набор.Добавить();
	//		Запись.Период = ДатаЗапроса;
	//		Запись.Пользователь = Пользователь;
	//		Запись.НомерСтрокиРезультата = ТекНомерСтроки;
	//		
	//		Запись.Запрос = КлючПоиска; 
	//		Запись.Производитель = СтрокаРезультата.Ссылка.Производитель;
	//		Запись.Артикул = СтрокаРезультата.Ссылка.Артикул;
	//		Запись.ГруппаТМЦ = СтрокаРезультата.Ссылка.Родитель;
	//		Запись.Остаток = СтрокаРезультата.СвободныйОстаток;
	//		Запись.Статус = ?(Запись.Остаток > 0, Перечисления.СТ_СтатусыЗапросов.A, Перечисления.СТ_СтатусыЗапросов.B);
	//		
	//		ТекНомерСтроки = ТекНомерСтроки + 1;
	//		
	//	КонецЦикла; 				   
	//	Набор.Записать();
	//	
	//	
	//Конецесли;

КонецПроцедуры

Функция ПолучитьПроцентСкидкиПоСоглашению(Соглашение) Экспорт

	ЗначениеСкидкиНаценки = 0;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка КАК СкидкаНаценка,
		|	МАКСИМУМ(ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценки, 0)) КАК ЗначениеСкидкиНаценки
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(, Источник = &Соглашение) КАК ДействиеСкидокНаценокСрезПоследних
		|ГДЕ
		|	ДействиеСкидокНаценокСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ВариантОтбораНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.БезОграничений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗначениеСкидкиНаценки = ВыборкаДетальныеЗаписи.ЗначениеСкидкиНаценки;				
	КонецЕсли;
	
	Возврат ЗначениеСкидкиНаценки;

КонецФункции // ()

Процедура ОбновитьСкидкиПоСоглашению(Соглашение, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	//Очищаем все записи по соглашению в СТ_ДополнительныеСкидки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СТ_ДополнительныеСкидки.Период,
		|	СТ_ДополнительныеСкидки.Соглашение
		|ИЗ
		|	РегистрСведений.СТ_ДополнительныеСкидки КАК СТ_ДополнительныеСкидки
		|ГДЕ
		|	СТ_ДополнительныеСкидки.Соглашение = &Соглашение";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СТ_ДополнительныеСкидки = РезультатЗапроса.Выбрать();
	
	Пока СТ_ДополнительныеСкидки.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.СТ_ДополнительныеСкидки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(СТ_ДополнительныеСкидки.Период);
		НаборЗаписей.Отбор.Соглашение.Установить(СТ_ДополнительныеСкидки.Соглашение);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), СТ_ДополнительныеСкидки.Соглашение,,,Отказ);
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидокНаценокСрезПоследних.Период,
		|	ДействиеСкидокНаценокСрезПоследних.Источник КАК Соглашение,
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка,
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных,
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ВариантОтбораНоменклатуры КАК ВариантОтбораНоменклатуры,
		|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(, Источник = &Соглашение) КАК ДействиеСкидокНаценокСрезПоследних
		|ГДЕ
		|	ДействиеСкидокНаценокСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.СпособПредоставления = ЗНАЧЕНИЕ(Перечисление.СпособыПредоставленияСкидокНаценок.Процент)
		|	И НЕ ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДействиеСкидокНаценок = РезультатЗапроса.Выбрать();
	
	ПолеНоменклатура		 = Новый ПолеКомпоновкиДанных("Номенклатура");
	ПолеНоменклатураГруппа	 = Новый ПолеКомпоновкиДанных("Номенклатура.Родитель");
	ПолеПроизводитель		 = Новый ПолеКомпоновкиДанных("Номенклатура.Производитель");
	
	Пока ДействиеСкидокНаценок.Следующий() Цикл 
		
		Настройки = Неопределено;
		
		Если ДействиеСкидокНаценок.ВариантОтбораНоменклатуры = Перечисления.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.ОтборКомпоновкиДанных Тогда
			Настройки = ДействиеСкидокНаценок.ХранилищеНастроекКомпоновкиДанных.Получить();
		КонецЕсли;
		
		Если Настройки = Неопределено
			Или НЕ ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Настройки, "ОтборПоНоменклатуре") Тогда
			Продолжить;
		КонецЕсли;
		
		СписокГрупп				 = Новый СписокЗначений;
		СписокПроизводителей	 = Новый СписокЗначений;
		Производитель			 = Неопределено;
		
		Для каждого ЭлементОтбора Из Настройки.ОтборПоНоменклатуре.Отбор.Элементы Цикл
			
			Если НЕ ЭлементОтбора.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭлементОтбора.ЛевоеЗначение = ПолеНоменклатура Тогда
				
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
					СписокГрупп.Добавить(ЭлементОтбора.ПравоеЗначение);
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
					СписокГрупп = ЭлементОтбора.ПравоеЗначение;
				КонецЕсли;
			
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = ПолеНоменклатураГруппа Тогда
				
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
					СписокГрупп.Добавить(ЭлементОтбора.ПравоеЗначение);
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
					СписокГрупп = ЭлементОтбора.ПравоеЗначение;
				КонецЕсли;
			
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = ПолеПроизводитель Тогда
				
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
					СписокПроизводителей.Добавить(ЭлементОтбора.ПравоеЗначение);
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
					СписокПроизводителей = ЭлементОтбора.ПравоеЗначение;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(СписокГрупп)
			ИЛИ НЕ ЗначениеЗаполнено(СписокПроизводителей) Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаГруппа Из СписокГрупп Цикл
			
			Группа = СтрокаГруппа.Значение;
			
			Если НЕ ЗначениеЗаполнено(Группа) Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаПроизводитель Из СписокПроизводителей Цикл
				
				ЗначениеПроизводителя = СтрокаПроизводитель.Значение;
				
				Если НЕ ЗначениеЗаполнено(ЗначениеПроизводителя) Тогда
					Продолжить;
				КонецЕсли;
			
				Запись = РегистрыСведений.СТ_ДополнительныеСкидки.СоздатьМенеджерЗаписи();
				Запись.Период		 = ДействиеСкидокНаценок.Период;
				Запись.Соглашение	 = Соглашение;
				Запись.Производитель = ЗначениеПроизводителя;
				Запись.Группа		 = Группа;
				Запись.Скидка		 = ДействиеСкидокНаценок.ЗначениеСкидкиНаценки;
				
				Попытка
					Запись.Записать();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), Соглашение,,,Отказ);
					Возврат;
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМестоХранения(Номенклатура, Склад) Экспорт

	МестоХранения = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СТ_МестаХраненияНоменклатурыНаСкладахСрезПоследних.МестоХранения
		|ИЗ
		|	РегистрСведений.СТ_МестаХраненияНоменклатурыНаСкладах.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК СТ_МестаХраненияНоменклатурыНаСкладахСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МестоХранения = Выборка.МестоХранения;	
		
	КонецЕсли;
	
	Возврат МестоХранения;

КонецФункции // ПолучитьМестоХранения()
 
Функция ПолучитьДанныеПодписиПользователя(Пользователь,ОтветственноеЛицо)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Должность,
		|	ОтветственныеЛицаОрганизаций.Наименование
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	(ОтветственныеЛицаОрганизаций.ДатаНачала <= &ТекущаяДата
		|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаНачала = &ПустаяДата)
		|	И (ОтветственныеЛицаОрганизаций.ДатаОкончания >= &ТекущаяДата
		|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = &ПустаяДата)
		|	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ФизическоеЛицо", Пользователь.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЕстьПравоПодписиПользователя(Пользователь)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Должность,
		|	ОтветственныеЛицаОрганизаций.Наименование
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	(ОтветственныеЛицаОрганизаций.ДатаНачала <= &ТекущаяДата
		|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаНачала = &ПустаяДата)
		|	И (ОтветственныеЛицаОрганизаций.ДатаОкончания >= &ТекущаяДата
		|			ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = &ПустаяДата)
		|	И ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ФизическоеЛицо", Пользователь.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПодписантаКладовщикаЗаместителя(Склад)    Экспорт
	
	Кладовщик = "";
	Должность = "";
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Новый Структура("Кладовщик,Должность",Кладовщик,Должность);
	КонецЕсли;
	
	Для каждого текСтрока Из Склад.ТекущийОтветственный.ДополнительныеРеквизиты Цикл
		Если Нрег(текСтрока.Свойство.Заголовок) = "в отпуске" 
			И текСтрока.Значение = Истина Тогда  
			Для каждого текСтр Из Склад.ДополнительныеРеквизиты Цикл
				Если Нрег(текСтр.Свойство.Заголовок) = "заместитель ответственного" Тогда
					Кладовщик = текСтр.Значение;
				КонецЕсли;	
				Если Нрег(текСтр.Свойство.Заголовок) = "должность заместителя ответственного" Тогда
					Должность = текСтр.Значение;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Кладовщик) Тогда
		Кладовщик = Склад.ТекущийОтветственный;
		Должность = Склад.ТекущаяДолжностьОтветственного;
	КонецЕсли;
	
	Возврат Новый Структура("Кладовщик,Должность",Кладовщик,Должность);
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ДобавитьСтрокуВКлючПоиска(КлючПоиска, Строка)

	КлючПоля = ПолучитьКлючПоСтроке(Строка);
	Если НЕ ПустаяСтрока(КлючПоля) Тогда
		КлючПоиска = КлючПоиска + ?(ПустаяСтрока(КлючПоиска), "", "&") + КлючПоля;	
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти
